{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 9], "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "d10bed1f514a497aae106b2c909101d5/dense_1/kernel", "shape": [9, 50], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_1/bias", "shape": [50], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_2/kernel", "shape": [50, 100], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_2/bias", "shape": [100], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_3/kernel", "shape": [100, 50], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_3/bias", "shape": [50], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_4/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "d10bed1f514a497aae106b2c909101d5/dense_4/bias", "shape": [1], "dtype": "float32"}]}]}