{"modelTopology": {"model_config": {"config": [{"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu", "kernel_regularizer": null, "dtype": "float32", "units": 50, "batch_input_shape": [null, 9]}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 100}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 50}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_4", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.2.2", "training_config": {"sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"config": {"decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "amsgrad": false}, "class_name": "Adam"}, "loss": "mean_squared_error", "metrics": []}}, "weightsManifest": [{"weights": [{"shape": [9, 50], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [50], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [50, 100], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [100], "dtype": "float32", "name": "dense_2/bias"}, {"shape": [100, 50], "dtype": "float32", "name": "dense_3/kernel"}, {"shape": [50], "dtype": "float32", "name": "dense_3/bias"}, {"shape": [50, 1], "dtype": "float32", "name": "dense_4/kernel"}, {"shape": [1], "dtype": "float32", "name": "dense_4/bias"}], "paths": ["group1-shard1of1"]}]}